NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/modules/OpenQBMM/tutorials/denseAGFoam/fluidizedBed/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    particles
);

boundaries
{
    inlet
    {
        type    fixedValue;
        value   uniform 0;
    }
    outlet
    {
        type    zeroGradient;
    }
    walls
    {
        type    zeroGradient;
    }
    frontAndBackPlanes
    {
        type    empty;
    }
}

particles
{
    type                alphaAndDiameter;
    Radau               false;
    weightDimension     [0 -3 0 0 0 0 0];
    abscissaDimension   [1 0 0 0 0 0 0];

    internal
    {
        node0
        {
            rho rho [1 -3 0 0 0 0 0] 2500;
            dia dia [0 1 0 0 0 0 0] 3e-4;
            alpha alpha [0 0 0 0 0 0 0] 0.55;
        }
        node1
        {
            rho rho [1 -3 0 0 0 0 0] 2500;
            dia dia [0 1 0 0 0 0 0] 6e-4;
            alpha alpha [0 0 0 0 0 0 0] 0.55;
        }
    }
    inlet
    {
        node0
        {
            rho rho [1 -3 0 0 0 0 0] 2500;
            dia dia [0 1 0 0 0 0 0] 3e-4;
            alpha alpha [0 0 0 0 0 0 0] 0;
        }
    }
}


// ************************************************************************* //
